plans/artillery/artillery-latency-comparison.yml
# artillery-latency-comparison.yml
# Compares direct LiteLLM vs gateway-routed latency
#
# Usage:
#   Direct LiteLLM (requires port-forward):
#     kubectl port-forward svc/litellm 4000:4000 -n converse-proxy &
#     artillery run artillery-latency-comparison.yml -o report-direct.json
#
#   Through Gateway:
#     artillery run artillery-latency-comparison.yml \
#       --target https://api.ai.camer.digital \
#       -o report-gateway.json \
#       --overrides '{"config":{"defaults":{"headers":{"Authorization":"Bearer YOUR_LIGHTBRIDGE_KEY","x-ai-eg-model":"gemini-2.5-flash"}}}}'

config:
  target: "http://localhost:4000"  # Override with --target for gateway
  phases:
    - name: "Latency baseline"
      duration: 60
      arrivalRate: 2
  defaults:
    headers:
      Authorization: "Bearer {{ $GEMINI_API_KEY }}"
      Content-Type: "application/json"

scenarios:
  - name: "Chat completion - Gemini Flash"
    flow:
      - post:
          url: "/v1/chat/completions"
          json:
            model: "gemini/gemini-2.5-flash"
            messages:
              - role: "user"
                content: "Say hello"
            max_tokens: 10
          capture:
            - json: "$.choices[0].message.content"
              as: "response"